In [1]:
import numpy as np
from pandas import Series,DataFrame

import pandas as pd

In [2]:
#Empecemos creando dos Series

ser1 = Series([0,1,2],index=['A','B','C'])

#Mostrar
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
#Segunda serie
ser2 = Series([3,4,5,6],index=['A','B','C','D'])

#Mostrar 
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [4]:
#Que sucede cuando las sumamos
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [5]:
#Los valores NaN son sumados automaticamente

In [6]:
#Ahora con DataFrames!
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])

#Mostrar
dframe1

     A  B
NYC  0  1
LA   2  3

In [7]:
#Segundo DataFrame
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])

#Mostrar
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [8]:
#Que pasa si los sumamos?

dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [9]:
#Podemos sustituir los valores NaN

dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [10]:
#Podemos ver que los valores son sustituidos, sin embargo no hay SF, con valor en B, por lo tanto 
#sigue siendo NaN

In [11]:
#Mostrar
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [12]:
#Crear una Series desde la fila 0 del DataFrame
ser3 = dframe2.ix[0]

#Mostrar
ser3

A    0
D    1
C    2
Name: NYC, dtype: int64

In [13]:
#Ahora podemos usar operaciones aritmeticas
dframe2-ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6